#define PIN 13
void setup() {
  // put your setup code here, to run once:
  pinMode(PIN,OUTPUT);
}
//short_code
void sc(){
  digitalWrite(PIN,HIGH);
  delay(500);
}
//long_code
void lc(){
  digitalWrite(PIN,HIGH);
  delay(500);
}
//short_blank
void sb(){
  digitalWrite(PIN,LOW);
  delay(500);
}
//long_blank
void lb(){
  digitalWrite(PIN,LOW);
  delay(1500);
}
//机电系统原理及实践
void loop() {
  // put your main code here, to run repeatedly:
  //机 --..---..---.-.
  //嘀嘀嘀▢嘀嘀嘀▢滴▢滴▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢滴▢滴▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢滴▢嘀嘀嘀▢滴▢▢▢
  lc();sb();  lc();sb();  sc();sb();  sc();sb();  lc();sb();  
  lc();sb();  lc();sb();  sc();sb();  sc();sb();  lc();sb();  
  lc();sb();  lc();sb();  sc();sb();  lc();sb();  sc();lb();
  //电 ---.-.-..--.-.-
  //嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢滴▢嘀嘀嘀▢滴▢嘀嘀嘀▢滴▢滴▢嘀嘀嘀▢嘀嘀嘀▢滴▢嘀嘀嘀▢滴▢嘀嘀嘀▢▢▢
  lc();sb();  lc();sb();  lc();sb();  sc();sb();  lc();sb();  
  sc();sb();  lc();sb();  sc();sb();  sc();sb();  lc();sb();  
  lc();sb();  sc();sb();  lc();sb();  sc();sb();  lc();lb();  
  //这里需要7个空格作为词的分界吗
  //系 -----..-----.--
  //嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢滴▢滴▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢滴▢嘀嘀嘀▢嘀嘀嘀▢▢▢
  lc();sb();  lc();sb();  lc();sb();  lc();sb();  lc();sb();  
  sc();sb();  sc();sb();  lc();sb();  lc();sb();  lc();sb();  
  lc();sb();  lc();sb();  sc();sb();  lc();sb();  lc();lb();  
  //统 ------.--.-----
  //嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢滴▢嘀嘀嘀▢嘀嘀嘀▢滴▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢▢▢
  lc();sb();  lc();sb();  lc();sb();  lc();sb();  lc();sb();  
  lc();sb();  sc();sb();  lc();sb();  lc();sb();  sc();sb();  
  lc();sb();  lc();sb();  lc();sb();  lc();sb();  lc();lb();  
  //这里需要7个空格作为词的分界吗
  //原 -.-..---..-----
  //嘀嘀嘀▢滴▢嘀嘀嘀▢滴▢滴▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢滴▢滴▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢▢▢
  lc();sb();  sc();sb();  lc();sb();  sc();sb();  sc();sb();  
  lc();sb();  lc();sb();  lc();sb();  sc();sb();  sc();sb();  
  lc();sb();  lc();sb();  lc();sb();  lc();sb();  lc();lb();  
  //理 ---.-.......--.
  //嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢滴▢嘀嘀嘀▢滴▢滴▢滴▢滴▢滴▢滴▢滴▢嘀嘀嘀▢嘀嘀嘀▢滴▢▢▢
  lc();sb();  lc();sb();  lc();sb();  sc();sb();  lc();sb();  
  sc();sb();  sc();sb();  sc();sb();  sc();sb();  sc();sb();  
  sc();sb();  sc();sb();  lc();sb();  lc();sb();  sc();lb();
  //这里需要7个空格作为词的分界吗
  //及 -.-..----..-.-.
  //嘀嘀嘀▢滴▢嘀嘀嘀▢滴▢滴▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢滴▢滴▢嘀嘀嘀▢滴▢嘀嘀嘀▢滴▢▢▢
  lc();sb();  sc();sb();  lc();sb();  sc();sb();  sc();sb();  
  lc();sb();  lc();sb();  lc();sb();  lc();sb();  sc();sb();
  sc();sb();  lc();sb();  sc();sb();  lc();sb();  sc();sb();  
  //实 -.--.---..----.
  //嘀嘀嘀▢滴▢嘀嘀嘀▢嘀嘀嘀▢滴▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢滴▢滴▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢滴▢▢▢
  lc();sb();  sc();sb();  lc();sb();  lc();sb();  sc();sb();  
  lc();sb();  lc();sb();  lc();sb();  sc();sb();  sc();sb();  
  lc();sb();  lc();sb();  lc();sb();  lc();sb();  sc();lb();  
  //践 -...--.-----.-.-
  //嘀嘀嘀▢滴▢滴▢滴▢嘀嘀嘀▢嘀嘀嘀▢滴▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢嘀嘀嘀▢滴▢嘀嘀嘀▢滴▢嘀嘀嘀
  lc();sb();  sc();sb();  sc();sb();  sc();sb();  lc();sb();  
  lc();sb();  sc();sb();  lc();sb();  lc();sb();  lc();sb();  
  lc();sb();  lc();sb();  sc();sb();  lc();sb();  sc();sb();  lc();
  //这里需要7个空格作为词的分界吗
}

//1分钟120次发码，就是0.5s发一次，记500ms
/*
点（ · ）：1 （读 “滴” dit ，时间占据1t ）
划（—）：111 （读 “嗒” dah ，时间占据3t ）
字符内部的停顿（在点和划之间）：0 （时间占据1t ）
字符间停顿：000 （ 时间占据3t ）
单词间的停顿：0000000 （ 时间占据7t ）
*/

/*
“M O R S E(空格) C O D E” （morse code）
—— ——— ·—· ··· · / —·—· ——— —·· ·
--/---/.-./..././-.-./---/-../.
滴滴滴▢滴滴滴▢▢▢
滴滴滴▢滴滴滴▢滴滴滴▢▢▢
滴▢滴滴滴▢滴▢▢▢
滴▢滴▢滴▢▢▢滴▢▢▢▢▢▢▢
滴滴滴▢滴▢滴滴滴▢滴▢▢▢
滴滴滴▢滴滴滴▢滴滴滴

滴滴滴▢滴滴滴▢▢▢
滴滴滴▢滴滴滴▢滴滴滴▢▢▢
滴▢滴滴滴▢滴▢▢▢
滴▢滴▢滴▢▢▢滴▢▢▢?
滴滴滴▢滴▢滴滴滴▢滴▢▢▢
滴滴滴▢滴滴滴▢滴滴滴

滴sc();
滴滴滴lc();
▢sb();
▢▢▢lb();
*/

